In [1]:
import pandas as pd 
import os
import pyspark 
from pyspark.sql import SparkSession

In [2]:
#replace with correct directory where data files are located 
os.chdir(r'C:\Users\Nicho\gc-march-2022\data')

In [3]:
da = pd.read_csv('Indeed_DataAnalyst_2022.csv')
de = pd.read_csv('Indeed_DataEngineer_2022.csv')
ds = pd.read_csv('Indeed_DataScience_2022.csv')

In [4]:
da.info()
de.info()
ds.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1155 entries, 0 to 1154
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Unnamed: 0   1155 non-null   int64
 1   title        1155 non-null   object
 2   company      1153 non-null   object
 3   salary       388 non-null    object
 4   description  1153 non-null   object
 5   location     1153 non-null   object
dtypes: int64(1), object(5)
memory usage: 54.3+ KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4504 entries, 0 to 4503
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Unnamed: 0   4504 non-null   int64
 1   title        4504 non-null   object
 2   company      4504 non-null   object
 3   salary       1256 non-null   object
 4   description  4504 non-null   object
 5   location     4504 non-null   object
dtypes: int64(1), object(5)
memory usage: 211.2+ KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1153 entries, 0 to 1152
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Unnamed: 0   1153 non-null   int64
 1   title        1153 non-null   object
 2   company      1153 non-null   object
 3   salary       341 non-null    object
 4   description  1153 non-null   object
 5   location     1153 non-null   object
dtypes: int64(1), object(5)
memory usage: 54.2+ KB

There is a lot more rows in the engineering data than the other two sites. Only the salary column contains null values.

In [5]:
de = de.drop_duplicates()
de.info()
de

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4504 entries, 0 to 4503
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Unnamed: 0   4504 non-null   int64
 1   title        4504 non-null   object
 2   company      4504 non-null   object
 3   salary       1256 non-null   object
 4   description  4504 non-null   object
 5   location     4504 non-null   object
dtypes: int64(1), object(5)
memory usage: 246.3+ KB

,Unnamed: 0,title,company,salary,description,location
0,0,Data Engineer,"Computer Enterprises, Inc. (CEI)",$84.55 an hour,Proficient with relational data modeling.Big d...,+3 locationsRemote
1,1,Junior Data Engineer,Pepsico,"$90,000 - $100,000 a year",Manage and scale data pipelines from internal ...,+10 locationsRemote
2,2,Data Engineer,Nter,$60 - $100 an hour,Must have a thorough knowledge of data structu...,Remote
3,3,Data Engineer,Global IT,$70 - $80 an hour,Experience building and optimizing ‘big data’ ...,"Remote in San Diego, CA"
4,4,Data Engineer –with Kendra,Precision Technology,$60 - $62 an hour,Data engineer: 9 years (Required).Working Hour...,+1 locationRemote
...,...,...,...,...,...,...
4499,4499,Data Engineer (Mid-Level),Kforce,NaN,"As a Mid-Level Data Engineer, this role focuse...","McLean, VA 22102+5 locations"
4500,4500,Staff Software Engineer - SASE Data Plane,CyberCoders,"$120,000 - $215,000 a year",It is our mission to secure and protect your d...,"San Francisco, CA 94111 (Financial District ar..."
4501,4501,Sr. Data Engineer/Sr. Database Developer,Kelly,NaN,The Sr. Data Engineer is responsible for desig...,"Hybrid remote in Houston, TX 77002"
4502,4502,"Software Engineer, Data Engineering",Eastridge Workforce Solutions,$75 - $88 an hour,"Owner of the core company data pipeline, respo...","San Francisco, CA"
4503,4503,Data Engineer,ITAC Solutions,NaN,Strong background and competency in data analy...,"St. Louis, MO"

In [6]:
indeed_df = pd.concat([da,de,ds])
indeed_df.drop_duplicates(inplace=True)
indeed_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 6812 entries, 0 to 1152
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Unnamed: 0   6812 non-null   int64
 1   title        6812 non-null   object
 2   company      6810 non-null   object
 3   salary       1985 non-null   object
 4   description  6810 non-null   object
 5   location     6810 non-null   object
dtypes: int64(1), object(5)
memory usage: 372.5+ KB

In [7]:
indeed_df.head(5)

,Unnamed: 0,title,company,salary,description,location
0,0,Data Science Analyst- Marketing,Indeed,"$100,000 - $140,000 a year",Work across a wide range of data engineering t...,Remote in Texas+1 location
1,1,Data Analyst/Statistician,US Department of Veterans Affairs,"$51,980 - $103,518 a year",Create processes for assessing quality and acc...,"Hybrid remote in Ann Arbor, MI 48105"
2,2,Departmental Analyst 9-P11 - Data Analytics,State of Michigan,NaN,"And reporting, including biannual reports to t...","Dimondale, MI"
3,3,CRM Data Analyst,Zeiss Industrial Quality Solutions,"$60,000 - $70,000 a year",Responsible for maintaining SAP/CRM business p...,"Wixom, MI 48393+1 location"
4,4,Data Analyst,Winwire Technologies,NaN,Providing resource to add/delete/amend data wi...,Remote

In [8]:
import re
indeed_df['salary'] = indeed_df['salary'].str.lower()
indeed_df['salary'] = indeed_df['salary'].str.replace(',','')
indeed_df['salary'] = indeed_df['salary'].str.replace('-',' ')
indeed_df['salary'] = indeed_df['salary'].str.replace('$',' ')
indeed_df['salary'] = indeed_df['salary'].str.replace("[a-z]","")   
indeed_df['jobid'] = str(indeed_df['title']) + str(indeed_df['company']) + str(indeed_df['company'])

C:\Users\Nicho\AppData\Local\Temp/ipykernel_8564/1282624251.py:5: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  indeed_df['salary'] = indeed_df['salary'].str.replace('$',' ')
C:\Users\Nicho\AppData\Local\Temp/ipykernel_8564/1282624251.py:6: FutureWarning: The default value of regex will change from True to False in a future version.
  indeed_df['salary'] = indeed_df['salary'].str.replace("[a-z]","")

In [9]:
income_split = indeed_df['salary'].str.split(expand = True)
indeed_df['salary_lower_range'] =  income_split[0]
indeed_df['salary_upper_range'] =  income_split[1]
indeed_df.drop('salary',axis = 1,inplace=True)

In [10]:

indeed_df['company'].dropna(axis=0,inplace=True)
indeed_df['salary_lower_range'].fillna(0,inplace=True)
indeed_df['salary_upper_range'].fillna(0,inplace=True)
indeed_df['salary_lower_range'] = indeed_df['salary_lower_range'].astype(float)
indeed_df['salary_upper_range']  = indeed_df['salary_upper_range'].astype(float)
hourly_salaries = indeed_df[indeed_df['salary_lower_range'] < 100]
indeed_df = indeed_df[indeed_df['salary_lower_range'] > 100]

In [11]:
hourly_salaries['salary_lower_range']  = (hourly_salaries['salary_lower_range'] * 40) * 52
hourly_salaries['salary_upper_range'] = (hourly_salaries['salary_upper_range'] * 40) * 52

In [12]:
indeed_df = pd.concat([indeed_df,hourly_salaries])

In [23]:
indeed_df

6812

,Unnamed: 0,title,company,description,location,jobid,salary_lower_range,salary_upper_range
0,0,Data Science Analyst- Marketing,Indeed,Work across a wide range of data engineering t...,Remote in Texas+1 location,44819fba-990e-493c-8c15-ef147247cc74,100000.0,140000.0
1,1,Data Analyst/Statistician,US Department of Veterans Affairs,Create processes for assessing quality and acc...,"Hybrid remote in Ann Arbor, MI 48105",44819fba-990e-493c-8c15-ef147247cc74,51980.0,103518.0
3,3,CRM Data Analyst,Zeiss Industrial Quality Solutions,Responsible for maintaining SAP/CRM business p...,"Wixom, MI 48393+1 location",44819fba-990e-493c-8c15-ef147247cc74,60000.0,70000.0
7,7,Entry Level Data Analyst,"Antra, Inc",Secure access to data sources Determine data a...,+1 locationRemote,44819fba-990e-493c-8c15-ef147247cc74,60000.0,0.0
9,9,Business Data Analyst (Remote),Digital Strategy LLC,Supports data efforts in system modernization ...,Remote,44819fba-990e-493c-8c15-ef147247cc74,90000.0,100000.0
...,...,...,...,...,...,...,...,...
1147,1147,Sr. Machine Learning Ops Engineer,Food Management Search,Knowledge of ML Ops elements and architectures...,"San Francisco, CA",44819fba-990e-493c-8c15-ef147247cc74,0.0,0.0
1148,1148,"Sr. Lead Analytics Engineer, Smart Restaurant","Chick-fil-A, Inc.","Degree in data science, engineering, or simila...","Atlanta, GA 30349",44819fba-990e-493c-8c15-ef147247cc74,0.0,0.0
1149,1149,Service Management Data Analyst - Staff/Senior,Intermountain Healthcare,"Bachelor's degree in computer science, informa...","West Valley City, UT",44819fba-990e-493c-8c15-ef147247cc74,71947.2,113297.6
1150,1150,Senior Software Dev Engineer,Tandym Group,Lead the development and delivery of proprieta...,"New York, NY 10001 (Chelsea area)",44819fba-990e-493c-8c15-ef147247cc74,0.0,0.0
1152,1152,Senior Financial Analyst,Vaco,"We are on the hunt for a motivated, meticulous...","Charlotte, NC",44819fba-990e-493c-8c15-ef147247cc74,0.0,0.0